Repository: 84000/data-translation-memory
Catalog: toh257-v4.tmx
Source language: bo
Languages: en

source: །དེ་ནས་འཁོར་དེའི་ནང་ནས་བདུད་ཀྱི་བུ་འོད་འཕྲོ་རྩུབ་ཅེས་བྱ་བ་བདུད་ཀྱི་ཡུལ་ཐམས་ཅད་དང་ལྷན་ཅིག་ཏུ་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་ཕྱག་འཚལ་ཏེ་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་མིག་མིག་ཅེས་བགྱི་བ་ལགས་ན། བཙུན་པ་བཅོམ་ལྡན་འདས་ཅི་གཟུགས་རྣམས་ཀྱི་རྒྱུ་མིག་ལགས་སམ། འོན་ཏེ་མིག་གི་རྒྱུ་གཟུགས་རྣམས་ལགས་པ་ནས་ཅི་ཆོས་རྣམས་ཀྱི་རྒྱུ་ཡིད་ཀྱི་ཁམས་ལགས་སམ། འོན་ཏེ་ཡིད་ཀྱི་རྒྱུ་ཆོས་རྣམས་ཀྱི་བར་ལགས།
en: The māra named Rough Radiating Light, who was present in the retinue, now prostrated, together with all the others from Māra’s realm, to the feet of the Blessed One and asked, “Respected Blessed One, concerning the eye, is the eye the cause of forms, or are forms the cause of the eye? [. . .] Is the mind element the cause of mental phenomena, or are mental phenomena the cause of the mind element?”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་གཟུགས་རྣམས་ཀྱི་རྒྱུ་ཡང་མིག་མ་ཡིན་ལ། མིག་གི་རྒྱུ་ཡང་གཟུགས་རྣམས་མ་ཡིན་པ་ནས་ཆོས་རྣམས་ཀྱི་རྒྱུ་ཡང་ཡིད་མ་ཡིན་ལ། ཡིད་ཀྱི་རྒྱུ་ཡང་ཆོས་རྣམས་ཀྱི་བར་མ་ཡིན་ནོ།
en: The Blessed One replied, “Noble son, the eye is not the cause of forms, nor are forms the cause of the eye. [. . .] The mind is not the cause of mental phenomena, nor are mental phenomena the cause of the mind.

source: །རིགས་ཀྱི་བུ་འོན་ཀྱང་མིག་ནི་མིག་གིས་སྟོང་པའོ། །དེ་ལྟ་མོད་ཀྱི་མིག་ལ་རྟེན་ཅིང་མིག་གི་རྣམ་པར་ཤེས་པ་སྐྱེའོ།
en: Yet, noble son, although the eye is empty of the eye, the eye consciousness nevertheless arises based on the eye.

source: །དེའི་རྐྱེན་གྱིས་གཟུགས་རྣམས་རབ་ཏུ་ཤེས་པ་ནས་ཡིད་ཀྱི་རྐྱེན་གྱིས་ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་སྐྱེའོ།
en: The cognition of forms arises through the condition of the eye, [. . .] and the mind consciousness arises through the condition of the mind.

source: །དེའི་རྐྱེན་གྱིས་ཆོས་རྣམས་ཀྱི་བར་རྣམ་པར་ཤེས་པའོ།
en: Through those conditions, the sense objects, up to mental phenomena, are cognized.

source: །མིག་གི་རྣམ་པར་ཤེས་པ་དམིགས་ནས་གང་ནས་ཀྱང་འོང་བ་མེད་དོ། །གང་དུ་ཡང་འགྲོ་བ་མེད་དོ།
en: When one observes the eye consciousness, it does not come from or go anywhere.

source: །མིག་ཕྱི་ན་སྡོད་པ་ཡང་མེད་དེ། དུས་གསུམ་དུ་གཏོགས་པ་ཐམས་ཅད་ལ་གང་ལ་ཡང་མི་དམིགས་སོ། །མིག་ལ་འབྲི་བ་ཉིད་མེད་དོ། །གང་བ་ཉིད་མེད་དོ། །བརྡ་མེད་དོ། །ཐ་སྙད་མེད་དོ། །ཡང་དག་པར་འདུ་བ་མེད་དོ། །གཞི་མེད་དོ། །
en: As for the eye, it does not dwell anywhere outside, and it cannot be found anywhere in the three times. The eye is beyond decrease, increase, convention, designation, collection, and foundation.

source: དཔེར་ན་སྔ་དྲོའི་དུས་སུ་ཉི་མ་ཤར་བ་ན་སྐར་ཁུང་གང་དང་གང་དུ་ཉི་མའི་འོད་ཟེར་དག་ཞུགས་པ་ནི་ར་བ་ལ་གནས་པ་དག་ཏུ་ཡང་དག་པར་སྣང་ངོ་།
en: “To give an analogy, the sunbeams that enter the windows of a house when the sun rises in the morning appear to be resting on its walls.

source: །ར་བ་ལ་མུན་པ་དང་། སྣང་བ་དང་། རྟོག་པ་ཡང་མེད་དོ།
en: Yet the walls themselves are beyond any darkness, lightness, or concepts.

source: །ར་བ་གང་ཡིན་པ་དེ་ཉིད་སྣང་བ་ཡང་མ་ཡིན་ནོ།
en: The walls are not the light, and the light is not conditioned by the walls.

source: །ར་བའི་རྐྱེན་གྱིས་སྣང་བ་ཡང་མ་ཡིན་ཏེ། འོན་ཀྱང་དེ་ལ་སྣང་བ་ཡང་ཡོད་དོ། །
en: Nevertheless, the light appears on the walls.

source: སྣང་བ་གང་ཡིན་པ་དེ་ཉིད་ཉི་མ་དང་། ཉི་མ་གང་ཡིན་པ་དེ་ཉིད་སྣང་བ་ཡང་མ་ཡིན་ནོ།
en: That light is not the sun, nor is the sun is the light.

source: །ཉི་མ་ནུབ་པ་ན་སྣང་བ་ཡང་མེད་པར་འགྱུར་རོ། །གང་ན་ཡང་སྣང་བའི་འགྲོ་བ་དང་གཞི་མེད་དེ།
en: When the sun sets the light disappears, yet it does not go anywhere—it is groundless.

source: འོན་ཀྱང་ཉི་མའི་རྐྱེན་གྱིས་སྣང་བར་རབ་ཏུ་ཤེས་ཤིང་གཟུགས་ཀྱི་སྣང་བ་ལ་རྟེན་པར་ཡང་སྣང་ངོ་།
en: Still, the light is cognized through the condition of the sun, and it appears based on the appearance of form.

source: །དེ་བཞིན་དུ་ནང་གི་སྐྱེ་མཆེད་དྲུག་པོ་དེ་དག་གི་རྒྱུ་ཡང་ནང་གི་སྐྱེ་མཆེད་དྲུག་པོ་དེ་དག་ཡིན་ནོ་ཞེས་བྱ་བའི་བར་དུའོ།
en: Similarly, the cause of the six inner sense sources is not the six inner sense sources.

source: །ནང་གི་སྐྱེ་མཆེད་རྣམས་ཀྱི་རྒྱུ་ཡང་ཕྱི་རོལ་གྱི་སྐྱེ་མཆེད་རྣམས་མ་ཡིན་ཏེ། ཕན་ཚུན་དུ་བསྡུས་པ་ཉིད་ཀྱི་ཕྱིར་རོ།
en: The cause of the inner sense sources is not the outer sense sources either, because they are meeting each other.

source: །བསྡུས་པ་ལ་ནི་རྣམ་པར་རྒྱུ་བ་མེད་དོ། །ཡང་དག་པར་འདུ་བ་མེད་དོ། །གཞི་མེད་དོ།
en: Their meeting is beyond movement, collection, and foundation.

source: །ཕྱི་དང་ནང་གི་སྐྱེ་མཆེད་རྣམས་ལ་རྣམ་པར་ཤེས་པའི་བར་དང་། བརྡ་དང་། རྣམ་པར་རྒྱུ་བ་མེད་དོ། །ཡང་དག་པར་འདུ་བ་མེད་དོ། །གཞི་ཡང་མེད་པ་ཉིད་དེ། ཕན་ཚུན་དུ་བསྡུས་པ་ཉིད་ཀྱི་ཕྱིར་དང་། ཡུལ་མ་ཡིན་པ་ཉིད་ཀྱི་ཕྱིར་རོ།
en: Because they are meeting each other and because they are not objects, outer and inner sense sources are beyond consciousness, convention, movement, collection, and foundation.

source: །འོན་ཀྱང་རྣམ་པར་ཤེས་པས་རྣམ་པར་ཤེས་པར་བྱེད་དེ། འདུ་བྱེད་ཀྱི་རྐྱེན་གྱིས་རྣམ་པར་ཤེས་པ་ཡིན་པས་རྣམ་པར་ཤེས་པ་ཡང་འདུ་བྱེད་ཀྱི་རྒྱུ་ལགས་སོ།
en: Nevertheless, consciousness brings about cognition, and since consciousness is conditioned by formation, consciousness is also caused by formation.

source: །འདུ་བྱེད་རྣམས་ནི་གསུམ་སྟེ། ལུས་ཀྱི་འདུ་བྱེད་དང་། ངག་གི་འདུ་བྱེད་དང་། ཡིད་ཀྱི་འདུ་བྱེད་དོ།
en: “There are three types of formations: physical, verbal, and mental formations.

source: །དེ་ལ་ལུས་ཀྱི་འདུ་བྱེད་རྣམས་གང་ཞེ་ན།
en: What are the physical formations?

source: ལུས་ཀྱི་འདུ་བྱེད་རྣམས་ཞེས་བྱ་བ་ནི་དབུགས་རྔུབ་པ་དང་འབྱུང་བ་དག་ཡིན་ཏེ། དེ་དག་ནི་ལུས་ཀྱི་འདུ་བྱེད་རྣམས་སོ།
en: Inhalation and exhalation are the physical formations.

source: །དབུགས་རྔུབ་པ་དང་། འབྱུང་བ་དེ་དག་ཀྱང་ཡན་ལག་རྣམས་ལེན་པ་སྟེ། མི་མཉམ་པ་དང་མཉམ་པ་ཉིད་ཀྱི་ཕྱིར་དང་། མ་ནོར་བ་དེ་བཞིན་ཉིད་ཀྱི་ཕྱིར། གཞན་གང་ཡང་རུང་བའི་སྐལ་བ་མི་མཉམ་པ་ཉིད་དང་། སར་པ་སར་པ་དང་། རྙིང་པ་མེད་པ་ཉིད་དང་། རྣམ་པར་མི་གནས་པའི་མཚན་ཉིད་དང་། ནམ་མཁའ་དང་མཉམ་པ་དང་། ནམ་མཁའ་ལ་ཀུན་ཏུ་རྒྱུ་བ་དག་ཡིན་ནོ།
en: Inhalation and exhalation assume divisions: since they are unequaled and unmistaken suchness, they do not belong to any category whatsoever, they are beyond freshness and staleness, they have the characteristic of being nonabiding, they are equal to space, and they move within space.

source: །རླུང་གང་ཡིན་པ་དེ་ནི་ནམ་མཁའ་མ་ཡིན་ནོ། །ནམ་མཁའ་གང་ཡིན་པ་དེ་ཉིད་ཀྱང་རླུང་མ་ཡིན་ཏེ།
en: The winds are not space, nor is space the winds.

source: ཕན་ཚུན་དུ་འདྲེས་པ་ཡིན་ལ་ཕན་ཚུན་སྤྱོད་ཡུལ་ནི་མ་ཡིན་ནོ།
en: They mingle with each other, but each is not the domain of the other.

source: །གཉི་ག་སྟོང་པ་དང་། བརྗོད་དུ་མེད་པ་དང་། མཚན་ཉིད་དང་བྲལ་བ་དག་ཡིན་ནོ།
en: Both are empty, inexpressible, and free of characteristics.

source: །འབྲི་བ་དང་། གང་བ་མེད་པ་དག་ཡིན་ནོ།
en: They are beyond decrease and increase.

source: །ཕ་རོལ་དང་ཚུ་རོལ་ལ་གནས་པ་དང་། ཡང་དག་པའི་མཐའ་ཡང་དག་པར་འཕགས་པ་ནི་ལུས་ཀྱི་འདུ་བྱེད་རྣམས་ཡིན་ཏེ།
en: They remain hither and thither, and they are the exalted limit of reality. Such are the physical formations.

source: དེ་ལྟ་བས་ན་རྣམ་པར་ཤེས་པ་ལ་ལུས་ཀྱི་འདུ་བྱེད་རྣམས་གནས་པ་མ་ཡིན་ཏེ། ཚོགས་པ་མེད།
en: Therefore, the physical formations do not dwell within consciousness.

source: རྣམ་པར་རྒྱུ་བ་མེད། ཡང་དག་པར་འདུ་བ་མེད། གཞི་དང་ཡང་དག་པའི་རྗེས་སུ་འབྲེལ་བ་མེད་དོ།
en: They are beyond meeting, movement, and collection, and they are groundless.

source: །རྣམ་པར་ཤེས་པ་གཞི་དང་ཡང་དག་པར་རྗེས་སུ་འབྲེལ་པའོ་ཞེས་བྱ་བའི་བར་ཡང་དེ་བཞིན་ནོ།
en: The same goes for consciousness. [. . .] And it is groundless.

source: །དེ་ལ་ངག་གི་འདུ་བྱེད་རྣམས་ཞེས་བྱ་བ་གང་ཞེ་ན།
en: “What are the verbal formations?

source: རྟོག་པ་དང་། དཔྱོད་པ་རྣམས་སོ།
en: They are concepts and analysis.

source: །རྟོག་པ་རྣམས་གང་ཞེ་ན།
en: What are concepts?

source: གང་དག་དབུགས་རྔུབ་པ་འཇུག་པར་བྱེད་པ་དང་། འབྱུང་བར་བྱེད་པ་རྣམས་ཏེ།
en: They are that which causes inhalation and exhalation.

source: སེམས་ཀྱིས་རྗེས་སུ་འཐུན་པར་བྱས་པ་དག་ཡིན་ནོ།
en: They are created in accord with the mind.

source: །དེ་ལ་རྟོག་པ་རྣམས་ཀྱིས་རྟོག་པར་བྱེད་པ་ནས་འཇིག་པའི་མཚན་ཉིད་རྣམས་ཀྱིས་རྟོག་པར་བྱེད། ཡོངས་སུ་དག་པ་ལ་རྟོག་པར་བྱེད། རླུང་ལ་རྟེན་པའི་རྟོག་པ་དེ་དག་སྐྱེ་བར་བྱེད། དགག་པའི་བར་དུ་སྟེ། རྟོག་པའི་རླུང་རྣམས་ནི་སྐད་ཅིག་ལ་འཆེལ་པ་ཡིན་ནོ།
en: Concepts generate thoughts. They generate thoughts in terms of the characteristic of disintegration, they generate thoughts about purity, they generate thoughts that are based on the winds, and they cause them to cease. The winds of concepts develop momentarily.

source: །རླུང་རྣམས་ཀྱང་རྟོག་པ་རྣམས་ཡིན་པར་མི་འགྱུར་ཏེ།
en: The winds do not become thoughts—neither of these two is the domain of the other.

source: གཉི་ག་ཡང་ཕན་ཚུན་དུ་སྤྱོད་ཡུལ་མ་ཡིན་ཞིང་ཕན་ཚུན་དུ་མཚན་ཉིད་དང་བྲལ་བ་ནས་བརྗོད་དུ་མེད་པ་དག་དང་། ནམ་མཁའ་ལྟར་མེད་པ་དག་པའི་བར་དུའོ།
en: Both are free of characteristics, [. . .] inexpressible, and nonexistent like space.

source: །དེ་ལ་དཔྱོད་པ་རྣམས་གང་ཞེ་ན།
en: What is analysis?

source: དཔྱོད་པ་གང་དག་གྲང་བའི་རྣམ་པའམ། དྲོ་བའི་རྣམ་པར་ལུས་ཐམས་ཅད་ཀྱི་དབུགས་རྔུབ་པ་དང་འབྱུང་བའི་རླུང་རྣམས་རྒྱུ་བར་བྱེད་པ་ཡིན་ནོ།
en: Analysis is what causes the movement of the winds of inhalation and exhalation throughout the entire body with either aspect of cold or warmth.

source: །དཔྱོད་པ་དག་གིས་འདུས་ཏེ་རེག་པ་རྣམ་པར་མི་ཤེས་ཏེ།
en: Analysis does not cognize contact and touch.

source: དཔྱོད་པ་དེ་དག་རླུང་རྣམས་དང་ཕན་ཚུན་དུ་སྤྱོད་ཡུལ་མ་ཡིན་ཏེ།
en: Analysis and the winds are not each other’s domains.

source: ཕན་ཚུན་དུ་མཚན་ཉིད་དང་བྲལ་བ་ནས་བརྗོད་དུ་མེད་པ་དག་པའི་བར་དུའོ།
en: Both are mutually free of characteristics [. . .] and inexpressible.

source: ཡིད་ཀྱི་འདུ་བྱེད་རྣམས་ཞེས་བྱ་བ་ནི་འདུ་ཤེས་དང་སེམས་པའོ།
en: The mental formations are perception and intention.

source: །དེ་ལ་འདུ་ཤེས་གང་ཞེ་ན།
en: What is perception?

source: སེམས་གང་གིས་ཆོས་དེ་དག་དེ་ལྟར་ཤེས་པ་ནས་གང་གི་ཚེ་དབུགས་རྔུབ་པ་དེའི་ཚེ་དབུགས་འབྱུང་བ་མེད་དོ་ཞེས་བྱ་བའི་བར་དུ་སྟེ།
en: It is the mind that understands phenomena to be a certain way. [. . .] At the time of inhalation, there is no exhalation.

source: དེ་ལྟར་འདུ་བྱེད་རྣམས་ལ་འདུ་ཤེས་རྣམ་པར་བསྒོམས་པ་ཡིན་ནོ།
en: In this way perception becomes accustomed to formations.

source: །ཡང་དག་པར་བྱུང་ནས་ཀྱང་འདུ་བྱེད་རྣམས་ཟད་པ་ཡིན་ཏེ།
en: After they arise, the formations are exhausted.

source: རྗེས་སུ་འཐུན་པར་འདུ་ཤེས་པས་ཀྱང་འདུ་བྱེད་ཀྱི་འདུ་ཤེས་རྣམ་པར་སྒོམ་པར་བྱེད་པ་འདི་ནི་འདུ་ཤེས་ཞེས་བྱ་སྟེ།
en: By perceiving them accordingly, the perception of formations is cultivated.

source: འདུ་ཤེས་དེ་ནི་རླུང་རྣམས་ལ་རྟེན་པ་ནས་གཉི་ག་བརྗོད་དུ་མེད་པའི་བར་དུའོ།
en: This is what is meant by ‘perception.’ Perception is based on the winds, [. . .] and both are inexpressible.

source: །དེ་ལ་སེམས་པ་གང་ཞེ་ན།
en: What is intention?

source: སེམས་པ་གང་དག་གིས་ཞེས་བྱ་བ་ནས་འདུ་བྱེད་རྣམས་ལ་འདུ་ཤེས་རྣམ་པར་བསྒོམས་པས་ཡང་དག་པ་ཉིད་སྐྱོན་མེད་པ་ལ་ཞུགས་ཤིང་སོ་སོའི་སྐྱེ་བོའི་ས་ལས་རྣམ་པར་འདས་པར་བྱེད་དོ་ཞེས་བྱ་བའི་བར་དུ་སྟེ།
en: Through intentions, [. . .] perception becomes accustomed to formations, one enters into faultless reality, and one transcends the level of ordinary beings.

source: སྐྱེ་བ་དང་འཇིག་པ་སྒོམ་པ་འདུ་བྱེད་རྣམས་ལས་སེམས་སེལ་བར་བྱེད་པ། རླུང་རྣམས་འཕྲོ་བར་མི་བྱེད་པ་འདི་ནི་སེམས་པ་ཞེས་བྱའོ།
en: Becoming accustomed to birth and disintegration clears away formations from the mind so that the winds are no longer stirred.

source: །ཚོར་བ་གསུམ་སྤང་བའི་ཕྱིར་ཡེ་ཤེས་ཀྱི་རྟེན་མིག་མ་འདྲེས་པ་ཅན་ཞེས་བྱ་བ་ནས། ཡིད་མ་འདྲེས་པ་ཅན་ཞེས་བྱ་བའི་བར་དང་། འཕགས་པ་ཞེས་བྱའོ་ཞེས་བྱ་བའི་བར་དུའོ།
en: This is what is meant by ‘intention.’ Since the three types of feelings are abandoned, one comes to possess the support of wisdom—the unadulterated eye [. . .] and the unadulterated mind—and one becomes a noble one.

source: །རིགས་ཀྱི་བུ་དེ་ལྟར་ཡང་གཟུགས་དམིགས་པའི་རྒྱུ་མིག་མ་ཡིན་ནོ། །མིག་གི་རྒྱུ་གཟུགས་མ་ཡིན་པ་ནས་ཆོས་རྣམས་ཀྱི་རྒྱུ་ཡིད་མ་ཡིན་ནོ། །ཡིད་ཀྱི་རྒྱུ་ཆོས་རྣམས་མ་ཡིན་པའི་བར་དུ་སྟེ།
en: “Noble son, in that way, the cause of the forms that are observed is not the eye, the cause of the eye is not forms, [. . .] the cause of mental phenomena is not the mind, and the cause of the mind is not mental phenomena.

source: གཉི་ག་ཕན་ཚུན་དུ་སྤྱོད་ཡུལ་མ་ཡིན།
en: They are not each other’s domains.

source: ཕན་ཚུན་དུ་བརྡར་བཏགས་པ་མ་ཡིན། རྣམ་པར་རྒྱུ་བ་མ་ཡིན། ཡང་དག་པར་གནས་པ་མ་ཡིན། ཡང་དག་པར་འདུ་བ་མ་ཡིན།
en: They are beyond verbal designation, movement, abiding, and collection.

source: བརྗོད་དུ་མེད་པ་དག་ཡིན། ཕ་རོལ་དང་ཚུ་རོལ་ལ་གནས་པ་དང་། ཡང་དག་པའི་མཐའ་ལ་ཡང་དག་པར་རྟེན་པ་དག་ཡིན་ནོ།
en: They are inexpressible, they remain hither and thither, and they are grounded in the limit of reality.”

source: །ཀྱེ་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་བསྟན་པ་འདི་བཤད་པ་ན་བདུད་ཀྱི་བུ་འོད་འཕྲོ་རྩུབ་བདུད་ཀྱི་འཁོར་སྔོན་གྱི་རྒྱལ་བ་ལ་ལྷག་པར་བྱ་བ་བྱས་པ་ཉི་ཁྲི་དང་ལྷན་ཅིག་ཏུ་རྗེས་སུ་འཐུན་པའི་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ།
en: Oh! As this teaching was given by the Blessed One, the māra Rough Radiating Light and twenty thousand members of the retinue of māras who had performed their duties under past victors achieved the concordant acceptance.

source: །དེའི་ཚེ་ལྷ་དང་མི་སྔོན་གྱི་རྒྱལ་བ་ལ་ལྷག་པར་བྱ་བ་བྱས་པ། སེམས་ཅན་དཔག་ཡས་པ་ཡང་བསམ་གཏན་དང་པོ་ལ་གནས་པར་གྱུར་པ་ནས་བསམ་གཏན་བཞི་པའི་བར་ཐོབ་པར་གྱུར་ཏོ།
en: At that time, countless gods and humans who had performed their duties under past victors also settled within the first concentration and in the other concentrations up to the fourth.

source: །ཁ་ཅིག་ནི་འབྲས་བུ་དང་པོ་ལ་གནས་པར་གྱུར་པ་ནས་འབྲས་བུ་གསུམ་པ་ལ་གནས་པར་གྱུར་པའི་བར་དུའོ།
en: Some settled within the first fruition, others in the fruitions up to the third one.

source: །ཁ་ཅིག་གིས་ནི་ཉན་ཐོས་ཀྱི་ཐེག་པ་ལ་ས་བོན་བསྐྱེད་པ་ནས་རྐྱེན་གྱི་ཐེག་པ་ལ་ས་བོན་བསྐྱེད་པའི་བར་དུའོ། །ཁ་ཅིག་གིས་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ།
en: Some planted the seeds of the hearers’ vehicle, some planted the seeds of the vehicle of conditions, and some gave rise to the mind set on unsurpassed and perfect awakening.

source: །ཀླུའི་འཁོར་དེའི་ནང་ནས་ཀྱང་ཀླུ་དཀྲིགས་ཕྲག་དྲུག་ཅུས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སྔོན་མ་བསྐྱེད་པའི་སེམས་བསྐྱེད་པར་གྱུར་ཏོ།
en: Within that retinue of nāgas, six quintillion nāgas gave rise to the mind set on unsurpassed and perfect awakening that they had not previously generated.

source: །སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་ཐམས་ཅད་དུ་ས་ཆེན་པོ་རྣམ་པ་དྲུག་ཏུ་རབ་ཏུ་འགུལ་ཏོ།
en: Throughout the entire buddha realm of Sahā, the great earth shook six times.

source: །དེར་ཕྱོགས་བཅུ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་དག་ལྷགས་པ་དེ་དག་གིས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པའི་ལས་བྱ་བའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་རབ་ཏུ་ཕྱེ་བའི་རིན་པོ་ཆེའི་ཆར་པ་དང་། རས་བཅོས་བུའི་ཆར་པ་དང་། མེ་ཏོག་གི་ཆར་པ་སྣ་ཚོགས་རབ་ཏུ་ཕབ་སྟེ་གསོལ་པ།
en: To worship the Blessed One, the bodhisattva great beings who had come to that place from the ten directions showered various rains of precious gems, fine fabrics, and flowers through the power of their different bodhisattva absorptions.

source: སྔོན་མ་ཐོས་པའི་འདུས་པ་འདི་དང་། ཏིང་ངེ་འཛིན་བསྟན་པ་འདི་ནི་མཆོག་ཏུ་ངོ་མཚར་ལགས་ཤིང་རྨད་དུ་བྱུང་བ་ལགས་སོ།
en: They exclaimed, “This Assembly, which has never been heard before, this teaching on absorption, is truly amazing and marvelous!

source: །འདི་ནི་ཤཱཀྱ་ཐུབ་པའི་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་གཉིས་པ་ལགས་སོ།
en: This is the second turning of the Dharma wheel of Śākyamuni!

source: །བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་ཅག་གིས་ཀྱང་ཉི་མའི་སྙིང་པོ་ལུང་བསྟན་པ་ཆེན་པོ་ཤིན་ཏུ་རྒྱས་པའི་སྡེའི་མདོའི་གཟུངས་སྔགས་འདི་བཟུང་ནས་རང་རང་གི་སངས་རྒྱས་ཀྱི་ཞིང་རྣམས་སུ་སེམས་ཅན་རྣམས་ལ་རབ་ཏུ་བསྟན་པར་བགྱི་ལགས་སོ།
en: Respected Blessed One, we shall also remember this dhāraṇī mantra of this very extensive discourse—the great instruction of The Quintessence of the Sun—and teach it to sentient beings in our respective buddha realms!”

source: །དེར་བདུད་དང་། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། གྲུལ་བུམ་དང་། ཡི་དགས་དང་། ཤ་ཟ་གང་དག་ལྷགས་པ་དེ་དག་གིས་ཀྱང་མཆོག་ཏུ་ངོ་མཚར་ཐོབ་ནས་སིལ་སྙན་རྣམ་པ་སྣ་ཚོགས་ཀྱི་སྒྲ་འབྱིན་པར་བྱེད་ཅིང་བཅོམ་ལྡན་འདས་ལ་རིན་པོ་ཆེ་སྣ་ཚོགས་དང་། རས་བཅོས་བུ་དང་། ཆོས་གོས་དང་། རྒྱན་དང་། མེ་ཏོག་དང་། ཕྲེང་བ་དང་། དྲི་དང་། བྱུག་པ་སྣ་ཚོགས་ཀྱིས་མཆོད་པ་བྱས་སོ།
en: The māras, gods, nāgas, yakṣas, rākṣasas, asuras, garuḍas, kinnaras, mahoragas, kumbhāṇḍas, pretas, and piśācas who had assembled there were also truly amazed. They played different types of instruments and offered the Blessed One all kinds of precious gems, fine fabrics, Dharma robes, ornaments, flowers, garlands, perfumes, and ointments.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་ལ་ཐུགས་བརྩེ་བ་ཉེ་བར་བཟུང་སྟེ།
en: The nāga king Sāgara then said to the Blessed One, “Respected Blessed One, please look after us with affection!

source: བདག་གི་གནས་སུ་རྒྱ་མཚོ་ཆེན་པོར་བསོད་སྙོམས་ལ་གཤེགས་པར་གསོལ།
en: Please come to receive alms in our abode, the great ocean!

source: དེར་བཅོམ་ལྡན་འདས་ལས་བདག་འཁོར་དང་བཅས་པས་ཉི་མའི་སྙིང་པོ་ལུང་བསྟན་པ་ཆེན་པོ་འདི་ཐོག་མ་དང་། བར་དང་། ཐ་མ་འདི་ཐམས་ཅད་མཉན་པར་བགྱི་ལགས་སོ།
en: There, my retinue and I will listen to this great instruction of The Quintessence of the Sun in its entirety—including its beginning, middle, and end—from the Blessed One.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ལག་འགྲོའི་བདག་པོ་ད་དེ་བཞིན་གཤེགས་པ་རྒྱ་མཚོ་ཆེན་པོར་མི་གཤེགས་སོ། །གསོལ་པ།
en: The Blessed One replied, “Nāga lord, the Thus-Gone One will not enter the great ocean at this time.”

source: བཙུན་པ་བཅོམ་ལྡན་འདས་སུ་ཞིག་སེམས་རྩེ་གཅིག་པས་ཉི་མའི་སྙིང་པོ་ལུང་བསྟན་པ་ཆེན་པོ་འདི་ཉན་པར་བགྱིད་པའི་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོས་བསོད་ནམས་མང་པོ་ཇི་སྙེད་ཅིག་སྐྱེད་པར་བགྱིད་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Sāgara said, “Respected Blessed One, how much merit does a noble son or daughter who listens one-pointedly to this great instruction of The Quintessence of the Sun generate?”

source: ལག་འགྲོའི་བདག་པོ་སེམས་ཅན་སུ་ལ་ལ་ཞིག་བྱུང་ནས་གླིང་བཞི་པ་འདི་ཐམས་ཅད་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱིས་ཡོངས་སུ་གང་བར་བྱས་ནས་དེ་བཞིན་གཤེགས་པ་རྣམས་ལ་སྦྱིན་པ་སྦྱིན་པར་བྱེད་པ་དང་། སྐྱེས་བུ་ཅིག་ཤོས་སུ་ཞིག་སེམས་རྩེ་གཅིག་པས་ཉི་མའི་སྙིང་པོ་ལུང་བསྟན་པ་ཆེན་པོ་འདི་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་ཉན་པར་བྱེད་ན་བསོད་ནམས་ཀྱི་ཕུང་པོ་སྔ་མ་དེས་ནི་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཅིག་ཤོས་འདི་ལ་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོའོ།
en: The Blessed One replied, “Nāga lord, imagine that someone filled this entire four-continent world will all kinds of precious gems and offered it to the thus-gone ones. If another being listens with one-pointed attention to the complete great instruction of The Quintessence of the Sun in its entirety, the amount of merit generated by the former being would not match even a hundredth, a thousandth, or a trillionth of the merit generated by the latter person.

source: །སྟོང་གི་ཆ་དང་། བྱེ་བ་ཕྲག་བརྒྱ་སྟོང་གི་ཆ་དང་། གྲངས་དང་། ཆ་དང་། དཔེ་དང་། རྒྱུར་ཡང་མི་བཟོད་དོ།
en: In fact, no number, fraction, analogy, or illustration would come close.

source: །ལག་འགྲོའི་བདག་པོ་ཉི་མའི་སྙིང་པོ་འདི་ཐོས་པ་ཙམ་གྱི་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཡང་དེ་ལྟར་ཟབ་པ་ཡིན་ནོ།
en: Nāga lord, such is the scale of the merit generated merely by hearing this Quintessence of the Sun!”

source: །གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་གལ་ཏེ་ད་རྒྱ་མཚོ་ཆེན་པོར་མི་གཤེགས་ལགས་ན་བདག་གིས་ཀྱང་ཉི་མའི་སྙིང་པོ་ལུང་བསྟན་པ་ཆེན་པོ་འདི་མཉན་ནས་ཡི་གེར་བྲིས་ཏེ་བཅང་བར་བགྱི་ལགས་ན་རྒྱ་མཚོ་ཆེན་པོར་དགེ་བའི་ཆོས་ཇི་སྙེད་ཅིག་རྣམ་པར་འཕེལ་བར་འགྱུར་ལགས།
en: Sāgara then said, “Respected Blessed One, since you will not come to our great ocean at this time, if I write down this great instruction of The Quintessence of the Sun, now that I have heard it, and carry it with me, how many virtuous qualities will develop in the great ocean?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ལག་འགྲོའི་བདག་པོ་གང་དང་གང་དུ་ཉི་མའི་སྙིང་པོ་ལུང་བསྟན་པ་ཆེན་པོ་ཐམས་ཅད་བྲིས་ནས་འཆང་བར་འགྱུར་བ་དེ་དང་དེ་ཉིད་དུ་ཕན་ཡོན་བཅུ་འབྱུང་ངོ་།
en: The Blessed One replied, “Nāga lord, in all the places where this great instruction of The Quintessence of the Sun is written down in its entirety and carried, ten benefits will manifest.

source: ཁྱིམ་དེ་དང་དེ་ཞེས་བྱ་བ་ནས་ཡུལ་ཞེས་བྱ་བའི་བར་དེར་ནོར་དང་། འབྲུ་དང་། ཉེ་བར་སྤྱོད་པ་དང་། ལོངས་སྤྱོད་མང་པོ་དང་། རིན་པོ་ཆེ་རྣམ་པ་སྣ་ཚོགས་མ་ཚང་བ་མེད་པར་འགྱུར་རོ།
en: (1) The homes and lands in those places will be filled with plenty of wealth, grains, possessions, and valuables and with all kinds of precious gems.

source: །གཞན་ཡང་ཁྱིམ་མམ་ཡུལ་གང་ན་ཉི་མའི་སྙིང་པོ་ལུང་བསྟན་པ་ཆེན་པོ་འདི་བྲིས་ནས་མཆོད་པར་འགྱུར་བ་དེ་དང་དེར་མཆོད་རྟེན་ཆེན་པོ་དེ་དག་ན་གང་དག་དེ་ལ་མཆོད་པ་བྱ་བའི་ཕྱིར་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱེ་བ་ཕྲག་དྲུག་ཅུ་པོ་དེ་དག་གིས་ཀྱང་བལྟ་བ་དང་། ཕྱག་བྱ་བ་དང་། མཆོད་པ་བྱ་བ་དང་། བསྙེན་བཀུར་བྱ་བའི་ཕྱིར་ལྷགས་ནས་དེར་འཐབ་པ་དང་། ཐབ་མོ་དང་། མི་ངས་དང་། ནད་དང་། མུ་གེ་དང་། དམག་ཚོགས་གཉི་ག་དང་། དུས་མ་ཡིན་པའི་རླུང་དང་། ཆར་པ་དང་། ནད་རྣམ་པ་སྣ་ཚོགས་རབ་ཏུ་ཞི་བར་བྱེད་དོ།
en: (2) Furthermore, the six hundred million bodhisattva great beings who have gathered to venerate those great stūpas will come to meet, revere, worship, and serve all the homes and lands where this great instruction of The Quintessence of the Sun is written down and worshiped. There, they will completely pacify all disputes, fights, epidemics, diseases, famines, and the two kinds of armies, as well as untimely winds, rains, and illnesses.”

source: །ཡང་དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱེ་བ་ཕྲག་དྲུག་ཅུ་པོ་དེ་དག་ཐམས་ཅད་ཀྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་བགྱི་ལགས་སོ།
en: At that moment, all six hundred million bodhisattva great beings exclaimed, “Respected Blessed One, we shall do so!

source: །ཁྱིམ་མམ་ཞེས་བྱ་བ་ནས་ཡུལ་འཁོར་གྱི་བར་གང་ན་ཉི་མའི་སྙིང་པོ་ལུང་བསྟན་པ་ཆེན་པོ་འདི་ཡི་གེར་བྲིས་ཤིང་མཆོད་པར་འགྱུར་བ་དེར་བདག་ཅག་གིས་འཐབ་པ་དང་། ཐབ་མོ་དང་། མི་ངས་དང་། ནད་དང་། མུ་གེ་དང་། དམག་ཚོགས་གཉི་ག་དང་དུས་མ་ལགས་པའི་རླུང་དང་། ཆར་པ་རྣམ་པ་སྣ་ཚོགས་རབ་ཏུ་ཞི་བར་བགྱི་ལགས་སོ།
en: In all the homes and lands where this great instruction of The Quintessence of the Sun is written down and worshiped, we shall completely pacify all disputes, fights, epidemics, diseases, famines, and the two kinds of armies, as well as untimely winds and rains!”

source: །བཀའ་སྩལ་པ། གཞན་ཡང་ཁྱིམ་མམ་ཞེས་བྱ་བ་ནས་ཡུལ་འཁོར་ཞེས་བྱ་བའི་བར་གང་ན་ཉི་མའི་སྙིང་པོ་ལུང་བསྟན་པ་ཆེན་པོ་འདི་ཡི་གེར་བྲིས་པར་འགྱུར་བའི་ཡུལ་འཁོར་ཞེས་བྱ་བའི་བར་དེར་བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། རྒྱལ་པོ་ཆེན་པོ་བཞི་དང་། གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཉི་ཤུ་རྩ་བརྒྱད་འཁོར་དང་བཅས་པ་དང་། ལྷ་མོ་ཆེན་མོ་དཔལ་དང་། ལྷ་མོ་ཆེན་མོ་དབྱངས་ཅན་དང་། སའི་ལྷ་མོ་བརྟན་མ་དང་། སྨན་གྱི་ལྷ་མོ་གྲུབ་པ་འཁོར་དང་བཅས་པས་ཁྱིམ་ཞེས་བྱ་བ་ནས་ཡུལ་འཁོར་ཞེས་བྱ་བའི་བར་དེར་རྟག་པར་རྒྱུན་དུ་ཉིན་མཚན་དུ་སྲུང་བར་འགྱུར་རོ། །ཡོངས་སུ་སྐྱོང་བར་འགྱུར་རོ།
en: The Blessed One then said, “Furthermore, (3) Śakra, Brahmā, the Four Great Kings, the twenty-eight yakṣa leaders and their retinues, Śrī Mahādevī, the great goddess Sarasvatī, the earth goddess Sthāvarā, and the medicine goddess Accomplished One and her retinue will continuously, day and night, look after and protect the homes and lands where this great instruction of The Quintessence of the Sun is written down.”

source: །དེའི་ཚེ་བརྒྱ་བྱིན་དང་། ཚངས་པ་ཞེས་བྱ་བ་ནས་སྨན་གྱི་ལྷ་མོ་གྲུབ་པ་ཞེས་བྱ་བའི་བར་འཁོར་དང་བཅས་པས་ཀྱང་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་བགྱི་ལགས་སོ་ཞེས་བྱ་བ་ནས་གཞན་ཡང་ཞེས་བྱ་བའི་བར་དུ་སྟེ། ཁྱིམ་དང་ཞེས་བྱ་བ་ནས་ཡུལ་འཁོར་ཞེས་བྱ་བའི་བར་གང་ན་ཞེས་བྱ་བ་ནས་ཁྱིམ་དང་ཞེས་བྱ་བ་ནས། ཡུལ་འཁོར་ཞེས་བྱ་བའི་བར་དེ་དང་དེར་སངས་རྒྱས་མང་པོ་ལ་བསྙེན་བཀུར་བྱས་པ། དབང་ཆེ་བར་གྲགས་པ། དབང་ཆེ་བར་གྲགས་པ། སྦྱིན་པ་དང་། དུལ་བ་དང་། ཡང་དག་པར་སྡོམ་པ་ཕུན་སུམ་ཚོགས་པ་རྣམས་སྐྱེ་བ་ལེན་པར་བྱེད་དོ།
en: At that moment, Śakra, Brahmā, [. . .] the medicine goddess Accomplished One, and their retinues exclaimed, “Respected Blessed One, we shall do so! [. . .]” “Furthermore,” said the Blessed One, (4) “beings who have revered many buddhas in the past, who are powerful and renowned for their great strength, and who are endowed with perfect generosity, discipline, and restraint will take birth in all those homes and lands [. . .].

source: །གཞན་ཡང་ཁྱིམ་དེ་དང་དེར་སེམས་ཅན་རྣམས་འདོད་པའི་ཡོན་ཏན་ལྔ་ལ་མ་ཆགས་པ་དང་། རྟག་ཏུ་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བརྩོན་པར་འགྱུར་རོ་ཞེས་བྱ་བའི་བར་དུའོ།
en: (5) In those homes, sentient beings who are attached to the pleasures of the five senses will constantly exert themselves in the perfection of generosity.

source: །གཞན་ཡང་སྣོད་དུ་གྱུར་པའི་སྦྱིན་གནས་དེ་དག་ཉིད་ལ་མངོན་པར་དགའ་བར་འགྱུར་རོ།
en: (6) They will delight in those who are suitable recipients of generosity.

source: །གཞན་ཡང་དེར་རྟག་པར་རྒྱུན་དུ་ཆོས་ཀྱི་རོ་རྣམ་པ་སྣ་ཚོགས་ཀྱི་ཆར་པས་ཁྱབ་པར་འགྱུར་རོ་ཞེས་བྱ་བའི་བར་དུའོ།
en: (7) Those places will be continuously pervaded by a rain of rich Dharma water.
